[
  {
    "employer": "Cambustion",
    "jobTitle": "Software Engineer",
    "url": "https://www.cambustion.com",
    "tenure": "March 2023 - Present",
    "location": "Cambridge, United Kingdom",
    "bulletPoints": [
      "Spearheaded the development of web UIs and cross-platform applications integral to cutting-edge scientific instruments, including advanced gas and particle analysers.",
      "Collaborated with a cross-functional team of scientists and engineers to design and deliver robust software that fulfills complex business and technical requirements.",
      "Shipped exciting new customer-centric features into the UI of a novel product using React, Next.js, Zendesk Garden, TypeScript, Node.js and GraphQL.",
      "Speeded up the R&D process by 10x of a new product by developing a high-performance, multi-threaded dekstop application for live data capture and visualisation. Developed using Python, PySide6 (Qt), Scipy and Numpy.",
      "Added new features to the corporate website by using Next.js, TypeScript and DatoCMS. Features include vanity URLs for assets, improving SEO, setting up Google Analytics conversion tracking etc."
    ]
  },

  {
    "employer": "Jaguar Land Rover",
    "jobTitle": "Software & Systems Engineer",
    "url": "https://www.jaguarlandrover.com",
    "tenure": "September 2017 - February 2023",
    "location": "Warwickshire, United Kingdom",
    "bulletPoints": [
      "Delivered 4 multi-million pound software projects for instrument clusters and other automotive systems across 10+ vehicle programmes (2M+ production vehicles) by managing projects, collaborating with suppliers, planning sprints, resolving defects, and releasing software to production.",
      "Reduced the software download time by 98% by introducing Diagnostics-over-IP (DoIP) which involved gathering stakeholder requirements, authoring software specifications, and running unit/integration/end-to-end tests.",
      "Reduced 200K+ man-hours of service dealership costs and improved the customer experience by delivering over-the-air software update capabilities.",
      "Fixed 800+ software defects by leading defect reviews in Jira, analysing logs, reproducing issues, finding root cause, and validating fixes.",
      "Met new scalability and real-time requirements by migrating the software stack to a new platform utilising a service-oriented architecture by architecting software, and designing algorithms/APIs using SOME-IP and DDS."
    ]
  },
  {
    "employer": "MathWorks",
    "jobTitle": "FPGA Development Intern",
    "url": "https://www.mathworks.com",
    "tenure": "Summer 2016",
    "location": "Glasgow, United Kingdom",
    "bulletPoints": [
      "Implemented complex signal-processing algorithms for a radar proof-of-concept to demonstrate Mathworks products to customers. It consisted of a Xilinx Zynq SoC with an ARM microprocessor and FPGA programmable logic.",
      "Created new Simulink examples and authored documentation for the Xilinx Zynq hardware support package."
    ]
  },
  {
    "employer": "University of Bristol",
    "jobTitle": "Software and Electronics Intern",
    "url": "https://www.bristol.ac.uk/news/2015/september/unmanned-airborne-system.html",
    "tenure": "Summer 2015",
    "location": "Bristol, United Kingdom",
    "bulletPoints": [
      "Worked on an interdisciplinary autonomous UAV (drone) used for volcanology research on Ascension Island and was funded by Boeing.",
      "Designed and tested the UAV's communications system for live video and telemetry data. The Linux-based system utilised on-board video processing using gstreamer and transmitted data via long range Ubiquiti Wi-Fi transceivers."
    ]
  }
]
